# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in this lab's data folder.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
# import libraries here
import numpy as np
import pandas as pd

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [2]:
# your code here
temp=pd.read_csv('../data/Temp_States.csv', sep=';')

#### Print `temp`.

In [3]:
# your code here
temp

         City        State  Temperature  Unnamed: 3
0         NYC     New York    19.444444         NaN
1      Albany     New York     9.444444         NaN
2     Buffalo     New York     3.333333         NaN
3    Hartford  Connecticut    17.222222         NaN
4  Bridgeport  Connecticut    14.444444         NaN
5      Treton   New Jersey    22.222222         NaN
6      Newark   New Jersey    20.000000         NaN

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [4]:
# your code here
type(temp)

pandas.core.frame.DataFrame

In [5]:
temp.dtypes

City            object
State           object
Temperature    float64
Unnamed: 3     float64
dtype: object

In [6]:
temp.columns

Index(['City', 'State', 'Temperature', 'Unnamed: 3'], dtype='object')

In [7]:
temp=temp.drop(columns='Unnamed: 3')

In [8]:
temp.head()

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444

In [9]:
"""
Data frame brings the name os the city, it's state and the temperature of each city.
column 'Unnamed 3' was removed because there was no information necessary.
"""

"\nData frame brings the name os the city, it's state and the temperature of each city.\ncolumn 'Unnamed 3' was removed because there was no information necessary.\n"

#### Select the rows where state is New York.

In [10]:
temp['State']

0       New York
1       New York
2       New York
3    Connecticut
4    Connecticut
5     New Jersey
6     New Jersey
Name: State, dtype: object

In [11]:
temp_ny=temp.query('State=="New York"')
temp_ny

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [12]:
# your code here
temp_ny['Temperature'].mean()

10.740740739000001

#### Which states and cities have a temperature above 15 degrees Celsius?

In [13]:
# your code here
temp_temp=temp.query('Temperature>15')
temp_temp

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [14]:
temp_temp["City"]

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [15]:
# your code here
temp_15=temp.query('15<Temperature<20')

In [16]:
temp.query('Temperature>15 & Temperature<20')

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222

#### Find the mean and standard deviation of the temperature of each state.

In [17]:
# your code here
temp.groupby(temp['State']).mean()

             Temperature
State
Connecticut    15.833333
New Jersey     21.111111
New York       10.740741

In [18]:
temp.groupby(temp['State']).std()

             Temperature
State
Connecticut     1.964186
New Jersey      1.571348
New York        8.133404

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [19]:
# your code here
employees=pd.read_csv('../data/employees.csv', sep=';')
employees

     Name Department Education Gender      Title  Years  Salary  Unnamed: 7
0    Jose         IT  Bachelor      M    analyst      1      35         NaN
1   Maria         IT    Master      F    analyst      2      30         NaN
2   David         HR    Master      M    analyst      2      30         NaN
3   Sonia         HR  Bachelor      F    analyst      4      35         NaN
4  Samuel      Sales    Master      M  associate      3      55         NaN
5     Eva      Sales  Bachelor      F  associate      2      55         NaN
6  Carlos         IT    Master      M         VP      8      70         NaN
7   Pedro         IT       Phd      M  associate      7      60         NaN
8     Ana         HR    Master      F         VP      8      70         NaN

#### Explore the data types of the `employees` dataframe. Comment your results.

In [20]:
# your code here
employees.columns

Index(['Name', 'Department', 'Education', 'Gender', 'Title', 'Years', 'Salary',
       'Unnamed: 7'],
      dtype='object')

In [57]:
employees=employees.drop(columns='Unnamed: 7')
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

In [22]:
"""
your comments here

Data brings info about employees and internal information about them. 
column 'Unnamed 7' was removed because there was no information necessary.
"""

"\nyour comments here\n\nData brings info about employees and internal information about them. \ncolumn 'Unnamed 7' was removed because there was no information necessary.\n"

#### What's the average salary in this company?

In [58]:
# your code here
employees['Salary'].mean()

48.888888888888886

#### What's the highest salary?

In [59]:
# your code here
employees['Salary'].max()

70

#### What's the lowest salary?

In [60]:
# your code here
employees['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [61]:
# your code here
employees.groupby(employees['Salary']).min()

         Name Department Education Gender      Title  Years
Salary
30      David         HR    Master      F    analyst      2
35       Jose         HR  Bachelor      F    analyst      1
55        Eva      Sales  Bachelor      F  associate      2
60      Pedro         IT       Phd      M  associate      7
70        Ana         HR    Master      F         VP      8

#### Find all the information about an employee called David.

In [62]:
# your code here
employees[employees['Name']=='David']

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [67]:
# your code here
employees[employees['Name']=='David']

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Print all the rows where job title is associate.

In [95]:
# your code here
employees[employees['Title']=='associate']

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [72]:
# Method 1
# your code here
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [73]:
# Method 2
# your code here
employees.loc[0:2,:]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [77]:
# your code here
employees[employees['Salary']>55]

     Name Department Education Gender      Title  Years  Salary
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [87]:
# your code here
employees.groupby(employees['Years']).mean()

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [93]:
# your code here
employees.groupby(employees['Title'])[['Salary']].mean()

              Salary
Title
VP         70.000000
analyst    32.500000
associate  56.666667

####  Find the salary quartiles.

In [35]:
# your code here

#### Is the mean salary different per gender?

In [36]:
# your code here

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [37]:
# your code here

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [38]:
# your code here

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [39]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [40]:
# your code here

In [41]:
"""
your comments here
"""

'\nyour comments here\n'

####  What is the average purchase price?

In [42]:
# your code here

#### What are the highest and lowest purchase prices?

In [43]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [44]:
# your code here

#### How many customers do we have in Spain?

In [45]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [46]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [47]:
# your code here

#### Select all free orders.

In [48]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [49]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [50]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [51]:
# your code here

#### Select all orders made in the month of August.

In [52]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [53]:
# your code here

#### What's the  average amount of money spent by country?

In [54]:
# your code here

#### What's the most expensive item?

In [55]:
# your code here

#### What is the average amount spent per year?

In [56]:
# your code here